{
    "Andromeda": {
        "history": "Andromeda is named after a princess in Greek mythology who was chained to a rock as a sacrifice. It was first cataloged by the Greek astronomer Ptolemy in the 2nd century.",
        "significance": "It contains the Andromeda Galaxy, the closest spiral galaxy to the Milky Way, which is visible to the naked eye.",
        "importance": "Andromeda is important in deep-sky observation and serves as a marker for the nearby Andromeda Galaxy.",
        "number_of_stars": 16,
        "discovered_by": "Ptolemy",
        "mythology": "Andromeda was the daughter of King Cepheus and Queen Cassiopeia. She was chained to a rock as a sacrifice to a sea monster but was saved by Perseus.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "September to December",
        "notable_stars": ["Alpheratz", "Mirach", "Mu Andromedae"],
        "interesting_facts": "The Andromeda Galaxy is on a collision course with the Milky Way and is expected to merge in about 4.5 billion years."
    },
    "Aquarius": {
        "history": "Aquarius represents the water bearer in mythology. It is one of the oldest constellations, with references in Babylonian astronomy.",
        "significance": "Aquarius is associated with the rainy season and is often depicted pouring water.",
        "importance": "This constellation is significant for understanding ancient agricultural practices tied to seasonal rains.",
        "number_of_stars": 11,
        "discovered_by": "Unknown",
        "mythology": "Aquarius is often associated with Ganymede, a beautiful youth in Greek mythology who was taken to Olympus to serve as a cupbearer to the gods.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "January to March",
        "notable_stars": ["Sadalsuud", "Sadalmelik"],
        "interesting_facts": "Aquarius is one of the zodiac constellations and is often depicted as a man pouring water from a jug."
    },
    "Aquila": {
        "history": "Aquila is the Latin word for eagle and is associated with the myth of Zeus and his eagle.",
        "significance": "It contains the bright star Altair and is known for its prominence in the summer sky.",
        "importance": "Aquila is significant for navigation and is part of the Summer Triangle with Vega and Deneb.",
        "number_of_stars": 20,
        "discovered_by": "Unknown",
        "mythology": "In mythology, Aquila is often identified as the eagle that carried Zeus's thunderbolts.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "July to September",
        "notable_stars": ["Altair", "Alshain"],
        "interesting_facts": "Altair is one of the closest stars visible to the naked eye, located about 16.7 light-years away."
    },
    "Auriga": {
        "history": "Auriga is associated with the charioteer in Greek mythology and has been known since antiquity.",
        "significance": "It contains Capella, one of the brightest stars in the northern sky.",
        "importance": "Auriga's bright stars make it a useful point of reference for astronomers.",
        "number_of_stars": 10,
        "discovered_by": "Unknown",
        "mythology": "Auriga is often depicted as a charioteer, sometimes associated with Erichthonius, a mythical king of Athens.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "November to March",
        "notable_stars": ["Capella", "Hadar"],
        "interesting_facts": "Auriga is home to several open star clusters, including M36, M37, and M38."
    },
    "Canis Major": {
        "history": "Canis Major means 'Greater Dog' in Latin and is associated with Orion's hunting dogs in mythology.",
        "significance": "It contains Sirius, the brightest star in the night sky.",
        "importance": "Canis Major plays a significant role in the mythology of various cultures as a symbol of hunting.",
        "number_of_stars": 20,
        "discovered_by": "Unknown",
        "mythology": "Canis Major is often depicted as the dog of Orion, the hunter in Greek mythology.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "December to March",
        "notable_stars": ["Sirius", "Mirzam"],
        "interesting_facts": "Sirius is about 8.6 light-years away and is twice as massive as the Sun."
    },
    "Capricornus": {
        "history": "Capricornus is often depicted as a sea-goat and has roots in Babylonian astronomy.",
        "significance": "It is associated with the autumn equinox and is a zodiac sign.",
        "importance": "Capricornus is important in astrology and represents the period of transition from autumn to winter.",
        "number_of_stars": 30,
        "discovered_by": "Unknown",
        "mythology": "In mythology, Capricornus is often associated with the goat Amalthea, who nursed the infant Zeus.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "July to October",
        "notable_stars": ["Deneb Algedi", "Nashira"],
        "interesting_facts": "Capricornus is one of the oldest recognized constellations, dating back to ancient Babylon."
    },
    "Cassiopeia": {
        "history": "Cassiopeia is named after the vain queen in Greek mythology who boasted of her beauty.",
        "significance": "The constellation is easily recognizable due to its distinctive W shape.",
        "importance": "Cassiopeia is significant for navigation in the northern hemisphere.",
        "number_of_stars": 20,
        "discovered_by": "Unknown",
        "mythology": "Cassiopeia was punished by the gods for her vanity, and her constellation is often depicted as sitting on her throne.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "August to November",
        "notable_stars": ["Schedar", "Caph"],
        "interesting_facts": "Cassiopeia is circumpolar, meaning it is visible all year round in the northern hemisphere."
    },
    "Cetus": {
        "history": "Cetus represents a sea monster in Greek mythology and is linked to the story of Perseus.",
        "significance": "It contains the variable star Mira, known for its dramatic brightness changes.",
        "importance": "Cetus is important in both mythology and astronomy for its unique stars.",
        "number_of_stars": 20,
        "discovered_by": "Unknown",
        "mythology": "Cetus is often identified with the monster sent by Poseidon to devour Andromeda.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "November to March",
        "notable_stars": ["Mira", "Diphda"],
        "interesting_facts": "Mira was the first variable star ever to be discovered, changing brightness over a period of about 331 days."
    },
    "Columba": {
        "history": "Columba represents the dove and is associated with the story of Noah's Ark.",
        "significance": "It is a small constellation located near the southern hemisphere's sky.",
        "importance": "Columba is significant for its representation of peace and hope.",
        "number_of_stars": 10,
        "discovered_by": "Unknown",
        "mythology": "Columba is often depicted as the dove that returned to Noah with an olive branch.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "January to March",
        "notable_stars": ["Phact", "Wazn"],
        "interesting_facts": "Columba is a relatively modern constellation, introduced in the 17th century."
    },
    "Cygnus": {
        "history": "Cygnus is often depicted as a swan and has various mythological interpretations.",
        "significance": "It contains the bright star Deneb and is part of the Summer Triangle.",
        "importance": "Cygnus is significant in navigation and is a popular constellation for amateur astronomers.",
        "number_of_stars": 30,
        "discovered_by": "Unknown",
        "mythology": "In mythology, Cygnus is often associated with the story of Zeus transforming into a swan.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "July to October",
        "notable_stars": ["Deneb", "Albireo"],
        "interesting_facts": "Cygnus is home to several notable deep-sky objects, including the North America Nebula."
    },
    "Draco": {
        "history": "Draco is the dragon and is associated with various myths, including those of Ladon and Cadmus.",
        "significance": "It circumnavigates the north celestial pole, making it visible year-round in the northern hemisphere.",
        "importance": "Draco is important in navigation and celestial mapping.",
        "number_of_stars": 40,
        "discovered_by": "Unknown",
        "mythology": "Draco is often identified with the dragon that guarded the golden apples in the Garden of the Hesperides.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "April to October",
        "notable_stars": ["Thuban", "Eltanin"],
        "interesting_facts": "Thuban was once the pole star around 2700 BC."
    },
    "Gemini": {
        "history": "Gemini represents the twin brothers Castor and Pollux in Greek mythology.",
        "significance": "It is known for the bright stars Castor and Pollux, which mark the twins.",
        "importance": "Gemini is significant in astrology and has various cultural representations.",
        "number_of_stars": 20,
        "discovered_by": "Unknown",
        "mythology": "Gemini is associated with the twin brothers Castor and Pollux, who were inseparable in life.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "December to April",
        "notable_stars": ["Castor", "Pollux"],
        "interesting_facts": "Gemini is one of the zodiac constellations and is often depicted as two figures standing side by side."
    },
    "Grus": {
        "history": "Grus is known as the crane and was introduced in the 17th century.",
        "significance": "It is located in the southern sky and contains several interesting stars.",
        "importance": "Grus is significant for its distinct shape and placement in the sky.",
        "number_of_stars": 20,
        "discovered_by": "Keyser and de Houtman",
        "mythology": "Grus is often associated with the crane in various cultures, symbolizing grace and vigilance.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "September to December",
        "notable_stars": ["Alnair", "Gru"],
        "interesting_facts": "Grus is one of the few constellations that represents a bird."
    },
    "Hercules": {
        "history": "Hercules represents the mythical hero and is associated with various legends.",
        "significance": "It contains the Great Hercules Cluster, an important astronomical feature.",
        "importance": "Hercules is significant in mythology and astronomy.",
        "number_of_stars": 25,
        "discovered_by": "Unknown",
        "mythology": "Hercules is often depicted as a strongman who performed twelve labors as penance.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "June to September",
        "notable_stars": ["Kornephoros", "Zeta Herculis"],
        "interesting_facts": "The Great Hercules Cluster (M13) is one of the brightest globular clusters visible from Earth."
    },
    "Hydra": {
        "history": "Hydra represents a water snake in mythology and is one of the largest constellations.",
        "significance": "It contains many interesting stars and deep-sky objects.",
        "importance": "Hydra is significant for its size and prominence in the sky.",
        "number_of_stars": 70,
        "discovered_by": "Unknown",
        "mythology": "Hydra is often associated with the multi-headed serpent slain by Hercules.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "February to June",
        "notable_stars": ["Alphard", "Beta Hydrae"],
        "interesting_facts": "Hydra is the largest constellation in the sky, spanning over 3% of the celestial sphere."
    },
    "Leo": {
        "history": "Leo is associated with the lion in mythology and has been recognized since antiquity.",
        "significance": "It contains the bright star Regulus and is a prominent constellation.",
        "importance": "Leo is significant in astrology and cultural symbolism.",
        "number_of_stars": 30,
        "discovered_by": "Unknown",
        "mythology": "Leo is often identified with the Nemean Lion, which was slain by Hercules.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "February to May",
        "notable_stars": ["Regulus", "Denebola"],
        "interesting_facts": "Leo is one of the zodiac constellations and is often depicted as a lion."
    },
    "Lepus": {
        "history": "Lepus represents the hare in mythology and is located near Orion.",
        "significance": "It contains several notable stars and is often overlooked.",
        "importance": "Lepus is significant for its connection to Orion.",
        "number_of_stars": 15,
        "discovered_by": "Unknown",
        "mythology": "Lepus is often depicted as the hare that Orion is hunting.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "December to March",
        "notable_stars": ["Arneb", "Nihal"],
        "interesting_facts": "Lepus is located just below Orion, making it a companion constellation."
    },
    "Lupus": {
        "history": "Lupus is the wolf and is often associated with hunters in mythology.",
        "significance": "It is a faint constellation located in the southern hemisphere.",
        "importance": "Lupus is significant for its representation of wild animals.",
        "number_of_stars": 20,
        "discovered_by": "Unknown",
        "mythology": "Lupus is often depicted as a wolf being hunted by Centaurus.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "May to August",
        "notable_stars": ["Alpha Lup", "Beta Lup"],
        "interesting_facts": "Lupus is one of the few constellations that represents a wolf."
    },
    "Orion": {
        "history": "Orion is named after a hunter in Greek mythology and is one of the most recognizable constellations.",
        "significance": "It contains Betelgeuse and Rigel, two of the brightest stars.",
        "importance": "Orion is significant in navigation and mythology.",
        "number_of_stars": 80,
        "discovered_by": "Unknown",
        "mythology": "Orion was a giant huntsman whom Zeus placed among the stars.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "December to March",
        "notable_stars": ["Betelgeuse", "Rigel"],
        "interesting_facts": "Orion's Belt is made up of three stars in a straight line, making it easily identifiable."
    },
    "Pavo": {
        "history": "Pavo represents the peacock and is associated with the myth of Argus.",
        "significance": "It contains several bright stars and is prominent in the southern sky.",
        "importance": "Pavo is significant for its beauty and visibility.",
        "number_of_stars": 25,
        "discovered_by": "Unknown",
        "mythology": "Pavo is often associated with the peacock that Hera placed in the sky.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "July to October",
        "notable_stars": ["Alpha Pavo", "Beta Pavo"],
        "interesting_facts": "Pavo is one of the southern hemisphere's most beautiful constellations."
    },
    "Pegasus": {
        "history": "Pegasus is associated with the winged horse in Greek mythology and is one of the largest constellations.",
        "significance": "It contains the Great Square of Pegasus, an asterism used for navigation.",
        "importance": "Pegasus is significant in both mythology and astronomy.",
        "number_of_stars": 50,
        "discovered_by": "Unknown",
        "mythology": "Pegasus sprang from the blood of Medusa when she was slain by Perseus.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "September to December",
        "notable_stars": ["Markab", "Scheat"],
        "interesting_facts": "The Great Square of Pegasus is a prominent feature in the autumn sky."
    },
    "Phoenix": {
        "history": "Phoenix represents the mythical bird that regenerates from its ashes.",
        "significance": "It is a prominent constellation in the southern hemisphere.",
        "importance": "Phoenix symbolizes rebirth and renewal.",
        "number_of_stars": 20,
        "discovered_by": "Unknown",
        "mythology": "The Phoenix is a legendary bird that cyclically regenerates or is otherwise born again.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "November to February",
        "notable_stars": ["Ankaa"],
        "interesting_facts": "Phoenix is a relatively modern constellation, introduced in the 16th century."
    },
    "Pisces": {
        "history": "Pisces represents two fish in Greek mythology and is associated with the sea.",
        "significance": "It contains several notable stars and is linked to the zodiac.",
        "importance": "Pisces is significant in astrology and mythology.",
        "number_of_stars": 30,
        "discovered_by": "Unknown",
        "mythology": "Pisces is often associated with the story of Aphrodite and Eros, who transformed into fish to escape the monster Typhon.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "February to April",
        "notable_stars": ["Alrescha", "Fum al Samakah"],
        "interesting_facts": "Pisces is one of the zodiac constellations and is often depicted as two fish tied together."
    },
    "Piscis Austrinus": {
        "history": "Piscis Austrinus represents the southern fish and is associated with various myths.",
        "significance": "It contains the bright star Fomalhaut.",
        "importance": "Piscis Austrinus is significant for its visibility and connection to the zodiac.",
        "number_of_stars": 15,
        "discovered_by": "Unknown",
        "mythology": "Piscis Austrinus is often depicted as a fish swimming in the southern sky.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "September to December",
        "notable_stars": ["Fomalhaut"],
        "interesting_facts": "Fomalhaut is one of the brightest stars in the sky and is part of the zodiac."
    },
    "Puppis": {
        "history": "Puppis represents the stern of a ship and is part of the larger Argo constellation.",
        "significance": "It contains several notable deep-sky objects.",
        "importance": "Puppis is significant in maritime mythology and navigation.",
        "number_of_stars": 25,
        "discovered_by": "Unknown",
        "mythology": "Puppis is part of the Argo Navis, the ship of Jason and the Argonauts.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "January to April",
        "notable_stars": ["Naos", "Zeta Puppis"],
        "interesting_facts": "Puppis is home to several interesting deep-sky objects, including the Puppis A supernova remnant."
    },
    "Scorpius": {
        "history": "Scorpius represents the scorpion and is associated with various myths about battles and hunters.",
        "significance": "It contains the bright star Antares and is prominent in summer skies.",
        "importance": "Scorpius is significant in both astronomy and mythology.",
        "number_of_stars": 30,
        "discovered_by": "Unknown",
        "mythology": "Scorpius is often associated with the scorpion that killed Orion in Greek mythology.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "May to August",
        "notable_stars": ["Antares", "Shaula"],
        "interesting_facts": "Antares is a red supergiant star and is often referred to as the 'heart of the scorpion.'"
    },
    "Taurus": {
        "history": "Taurus is associated with the bull in mythology and has ancient roots in astronomy.",
        "significance": "It contains the Pleiades star cluster, which is significant in various cultures.",
        "importance": "Taurus is significant in agriculture and seasonal changes.",
        "number_of_stars": 50,
        "discovered_by": "Unknown",
        "mythology": "Taurus is often associated with the bull that Zeus transformed into to seduce Europa.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "November to March",
        "notable_stars": ["Aldebaran", "Hyades"],
        "interesting_facts": "The Pleiades star cluster, also known as the Seven Sisters, is one of the most famous star clusters in the night sky."
    },
    "Ursa Major": {
        "history": "Ursa Major represents the great bear and has been recognized since ancient times.",
        "significance": "It contains the Big Dipper, an important asterism for navigation.",
        "importance": "Ursa Major is significant for its visibility and connection to various myths.",
        "number_of_stars": 30,
        "discovered_by": "Unknown",
        "mythology": "Ursa Major is often associated with the story of Callisto, who was transformed into a bear.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "All year round",
        "notable_stars": ["Dubhe", "Merak"],
        "interesting_facts": "The Big Dipper is an asterism formed by seven bright stars in Ursa Major."
    },
    "Ursa Minor": {
        "history": "Ursa Minor represents the little bear and contains Polaris, the North Star.",
        "significance": "It is crucial for navigation in the northern hemisphere.",
        "importance": "Ursa Minor is significant due to its association with the North Star.",
        "number_of_stars": 30,
        "discovered_by": "Unknown",
        "mythology": "Ursa Minor is often associated with the story of Arcas, who was transformed into a bear.",
        "location": "Northern Hemisphere",
        "best_time_to_view": "All year round",
        "notable_stars": ["Polaris", "Kochab"],
        "interesting_facts": "Polaris is currently the North Star and is located nearly directly above the North Pole."
    },
    "Vela": {
        "history": "Vela represents the sails of the ship Argo and is associated with maritime exploration.",
        "significance": "It contains several notable stars and deep-sky objects.",
        "importance": "Vela is significant in navigation and maritime mythology.",
        "number_of_stars": 20,
        "discovered_by": "Unknown",
        "mythology": "Vela is part of the larger Argo constellation, which represents the ship of Jason and the Argonauts.",
        "location": "Southern Hemisphere",
        "best_time_to_view": "January to April",
        "notable_stars": ["Zeta Vela", "Gamma Vela"],
        "interesting_facts": "Vela is home to the Vela supernova remnant, which is a remnant of a massive star that exploded."
    }
}
